src/Catalogs/РА_ПодсистемаРасчетаБонусовПартнеров_КлючиАналитикиУчетаБонуснойПрограммы/РА_ПодсистемаРасчетаБонусовПартнеров_КлючиАналитикиУчетаБонуснойПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РА_ПодсистемаРасчетаБонусовПартнеров_КлючиАналитикиУчетаБонуснойПрограммы</name>
  <attributes>
    <name>ОбъектНастройки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_ПериодыДействияБонуса</types>
    </type>
  </attributes>
  <attributes>
    <name>УидБонуснойПрограммы</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/AccumulationRegisters/РА_ПодсистемаРасчетаБонусовПартнеров_БонусыПартнерам/РА_ПодсистемаРасчетаБонусовПартнеров_БонусыПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РА_ПодсистемаРасчетаБонусовПартнеров_БонусыПартнерам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаБонуснойПрограммы</name>
    <type>
      <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_БонусныеПрограммы</types>
      <types>CatalogRef.РА_ПодсистемаРасчетаБонусовПартнеров_КлючиАналитикиУчетаБонуснойПрограммы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПремии</name>
    <type>
      <types>EnumRef.РА_ТипыПремийПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Catalogs/РА_ПодсистемаРасчетаБонусовПартнеров_КлючиАналитикиУчетаБонуснойПрограммы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подобрать ключ аналитики учета бонусной программы.
// 
// Параметры:
//  ОбъектНастройки - ОпределяемыйТип.РА_ПодсистемаРасчетаБонусовПартнеров_ОбъектыНастройкиБонуснойПрограммы 
//  ПериодДействия - СправочникСсылка.РА_ПодсистемаРасчетаБонусовПартнеров_ПериодыДействияБонуса
//  УидБонуснойПрограммы - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.РА_ПодсистемаРасчетаБонусовПартнеров_КлючиАналитикиУчетаБонуснойПрограммы - Подобрать ключ аналитики учета бонусной программы
Функция ПодобратьКлючАналитикиУчетаБонуснойПрограммы(ОбъектНастройки, ПериодДействия, УидБонуснойПрограммы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РА_КлючиАналитикиУчетаБонуснойПрограммы.Ссылка КАК КлючАналитикиУчетаБонуснойПрограммы
	|ИЗ
	|	Справочник.РА_ПодсистемаРасчетаБонусовПартнеров_КлючиАналитикиУчетаБонуснойПрограммы КАК РА_КлючиАналитикиУчетаБонуснойПрограммы
	|ГДЕ
	|	РА_КлючиАналитикиУчетаБонуснойПрограммы.ОбъектНастройки = &ОбъектНастройки
	|	И РА_КлючиАналитикиУчетаБонуснойПрограммы.ПериодДействия = &ПериодДействия
	|	И РА_КлючиАналитикиУчетаБонуснойПрограммы.УидБонуснойПрограммы = &УидБонуснойПрограммы";

	Запрос.УстановитьПараметр("ОбъектНастройки", ОбъектНастройки);
	Запрос.УстановитьПараметр("ПериодДействия", ПериодДействия);
	Запрос.УстановитьПараметр("УидБонуснойПрограммы", УидБонуснойПрограммы);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.КлючАналитикиУчетаБонуснойПрограммы;
	Иначе
		НовыйКлюч = СоздатьЭлемент();
		НовыйКлюч.ОбъектНастройки = ОбъектНастройки;
		НовыйКлюч.ПериодДействия = ПериодДействия;
		НовыйКлюч.УидБонуснойПрограммы = УидБонуснойПрограммы;
		НовыйКлюч.Записать();

		Возврат НовыйКлюч.Ссылка;
	КонецЕсли;

КонецФункции

// Проверить использование ключа аналитики учета бонусной программы.
// 
// Параметры:
//  УидБонуснойПрограммы - Строка
// 
// Возвращаемое значение:
//  Булево - Проверить использование ключа аналитики учета бонусной программы
Функция ПроверитьИспользованиеКлючаАналитикиУчетаБонуснойПрограммы(УидБонуснойПрограммы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РА_БонусыПартнерам.АналитикаУчетаБонуснойПрограммы КАК АналитикаУчетаБонуснойПрограммы
	|ИЗ
	|	РегистрНакопления.РА_ПодсистемаРасчетаБонусовПартнеров_БонусыПартнерам КАК РА_БонусыПартнерам
	|ГДЕ
	|	РА_БонусыПартнерам.АналитикаУчетаБонуснойПрограммы.УидБонуснойПрограммы = &УидБонуснойПрограммы";

	Запрос.УстановитьПараметр("УидБонуснойПрограммы", УидБонуснойПрограммы);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Пометить ключ аналитики учета бонусной программы на удаление.
// 
// Параметры:
//  УидБонуснойПрограммы - Строка
Процедура ПометитьКлючАналитикиУчетаБонуснойПрограммыНаУдаление(УидБонуснойПрограммы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РА_КлючиАналитикиУчетаБонуснойПрограммы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РА_ПодсистемаРасчетаБонусовПартнеров_КлючиАналитикиУчетаБонуснойПрограммы КАК РА_КлючиАналитикиУчетаБонуснойПрограммы
	|ГДЕ
	|	РА_КлючиАналитикиУчетаБонуснойПрограммы.УидБонуснойПрограммы = &УидБонуснойПрограммы";

	Запрос.УстановитьПараметр("УидБонуснойПрограммы", УидБонуснойПрограммы);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КлючОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КлючОбъект.ПометкаУдаления = Истина;
		КлючОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
